Repository: samir-a-ts/producti
Catalog: lib/l10n/intl_*.arb
Languages: ru

# onboardingDesc1
source: Incredible every day tool with incredible performance.
ru: Прекрасный инструмент для быстрых действий и ежедневного пользования.

# onboardingDesc2
source: Managable and custom view of app. Be the boss, bruh.
ru: Изменяемый и уникальный вид приложения. Будь боссом, чел.

# onboardingDesc3
source: Create group with todos, then create reminder, add all this to new table and share with your freinds (if you have). Wooaah. Pretty effective tool.
ru: Создай список дел, потом напоминание, скопируй все в новую доску и поделись ею с друзьями (если они у тебя есть). Вау. Довольно эффективно.

source: Skip
ru: Пропустить

source: Next
ru: Далее

source: Fast
ru: Быстро

source: Comfortable
ru: Удобно

source: Effective
ru: Эффективно

# emailAlreadyInUse
source: Email was already used by other greedy user!
ru: Этот e-mail уже был использован другим человеком!

# userRemoved
source: This user was removed from system. Create new one.
ru: Этого пользователь был удален из системы. Создайте нового.

# userNotExists
source: You are trying to sign in to not existing account. Create one firstly. :)
ru: Сначала надо создать аккаунт, чтобы потом войти в него. :)

# wrongPassword
source: Not correct password for this account!
ru: Неверный пароль!

# userNotLoggedIn
source: No local account to sign in automatically!
ru: Вы не зарегестрированы на этом устройстве!

# invalidEmail
source: Not valid email was typed!
ru: Невалидный email!

# invalidPassword
source: Too short password!
ru: Слишком короткий пароль!

# funContinues
source: This is where the fun continues, boy.
ru: Здесь продолжится твое веселье, сладкий.

# passswordsNotMatch
source: Passwords are not equal!
ru: Пароли не совпадают!

# funBegins
source: This is where the fun begins, boy.
ru: Здесь начнется твое веселье, сладкий.

source: Sign in
ru: Вход

source: Sign up
ru: Регистрация

# signInLongButtonText
source: LET ME IIIIN
ru: А НУ ПУСТИ МЕНЯЯЯ

source: Password
ru: Пароль

source: Repeat password
ru: Пароль снова

# notPartOfParty
source: Still not part of our party?
ru: Ты еще не циркач в нашем цирке?

# join
source: Just join it.
ru: Присоединяйся.

# hatePeople
source: You hate people?
ru: Ты ненавидишь людей?

# signInAnonim
source: Sign in anonimously.
ru: Я тоже. Войди без регистрации.

# alreadyCoolGuy
source: Already in cool boys club?
ru: Уже часть нашего цирка?

# letHim
source: Let him in, boys.
ru: Представление уже началось!

# voidValue
source: Field is empty
ru: Пустое поле

source: Invalid link!
ru: Невалидная ссылка!

# failedToFetchUserData
source: Failed to fetch your data, something went wrong!
ru: Произошла какая то ошибка, не удалось запросить данные!

# connected
source: You are connected to the internet!
ru: Вы подключились к интернету!

# disconnected
source: Oops! Looks like you are out of interntet...
ru: Приём, приём...никого не слышно.

# notConnectedToInternet
source: You have no connection to internet!
ru: У вас нету подключения к интернету!

# doNotLoggedIn
source: You are not logged in!
ru: Вы не создали аккаунта!

source: Create account.
ru: Создать аккаунт.

source: Settings
ru: Настройки

source: Log out
ru: Выйти

source: Add one
ru: Добавить

# nothingToSee
source: Nothing to see here...
ru: Здесь ничего нет...

source: Create
ru: Создать

# tableAlreadyExists
source: This table already created!
ru: Эта таблица уже существует!

source: Table name
ru: Название таблицы

source: Group
ru: Группа

source: Note
ru: Заметка

source: Notification
ru: Напоминание

source: Group name
ru: Название группы

# groupAlreadyExists
source: This group already exists!
ru: Группа уже существует!

# tooBigValue
source: Too big, sempai...
ru: Слишком большой...

source: Note creation
ru: Создание заметки

source: Note details
ru: Детали заметки

# typeTitle
source: Type title here...
ru: Введите название заметки здесь...

# typeDescription
source: Type description here...
ru: А тут описание...

# typeLink
source: Type link here...
ru: Ссылочки...

source: Another one...
ru: Еще...

source: Add link
ru: Добавить ссылку

# notificationsInitializationFailure
source: For what reason you creating notifications and not let me show them to you??
ru: Зачем ты создаешь напоминания и потом не даешь мне...напоминать??

source: Edit
ru: Редактировать

source: Delete
ru: Удалить

source: Rename
ru: Переименовать

source: Yes
ru: Да

source: No
ru: Нет

# youSureToDelete
source: Are you sure you want to delete that element?
ru: Вы уверены, что хотите удалить данный элемент?

# youSureToDeleteGroup
source: Are you sure you want to delete that element? All their children would be deleted also.
ru: Вы уверены, что хотите удалить данный элемент? Все дочерние элементы будут тоже удалены.

# notificationInPast
source: You cannot remind something to yourself in past. :)
ru: Увы, вы не можете напомнить себе что то в прошлом. :(

# pickDate
source: Pick date here...
ru: Установить время напоминания...

# cannotDeleteSingle
source: You cannot delete your single table left!
ru: Вы не можете удалить свою единственную таблицу!

source: Notifications
ru: Напоминания

# color
source: Accent color
ru: Оттенок

source: Language
ru: Язык

source: English
ru: Английский

source: Russian
ru: Русский

source: Theme
ru: Тема

source: Notification creation
ru: Создание напоминания

# noTiles
source: Check list cannot be empty...
ru: Список задач не может быть пуст...

source: Check list create
ru: Создание списка задач

source: Add check
ru: Добавить задачу

source: Check list
ru: Список задач

# typeCheck
source: Type task
ru: Задача...

source: Check list details
ru: Детали списка задач

# voidDateValue
source: Date field is empty!
ru: Время не заполнено!

source: Do something
ru: Сделай что нибудь

source: You awesome
ru: Ты крутой

source: Another note
ru: Еще записка

source: Another group
ru: Еще группка

source: Wow
ru: Ух ты

# youAreReady
source: You are ready to work with Producti! Enjoy!
ru: Вы познакомились с приложением и готовы использовать его мощь! Вперёд!

# welcome
source: Welcome to Producti! Before you start your producitve day, I must teach you, how to work with app. So, listen, please, carefully.
ru: Добро пожаловать в Producti! Прежде чем использовать мое приложение, я должен научить вас им пользоваться. Эффективно. Слушай внимательно.

# addButtonTitle
source: "Add" button
ru: Кнопка "добавить"

# addButtonDescription
source: First button you to press. Will show you all cell types on next window...
ru: Откроет тебе окно со всеми типами "ячеек" в приложении. При нажатии на нужный тип ячейки переведёт вас на экран её создания.

# bottomSheetGroupDescription
source: Cell, that allows you add another cells inside him.
ru: Ячейка, которая хранит в себе другие ячейки.

# bottomSheetNoteDescription
source: Cell with title and body. Can store any your text. Also, you can save links inside of him.
ru: Записка с оглавлением и самим текстом. Вы можете вписать свой текст, а также добавить нужные вам ссылки.

# bottomSheetNotificationDescription
source: Same note, but with time when you would get a notification!
ru: Та же записка, но в нужное вам время напомнит о себе!

# bottomSheetCheckListDescription
source: Cell with title and...check list. A list of items which you can easily create and mark done.
ru: Ячейка с оглавлением и списком дел. Вы можете легко создавать дела, отмечать их сделанными и удалять.

# allCellsTitle
source: Beatiful, right?
ru: Красота...

# allCellsDescription
source: This is how notes, group, notification and check list looks like...
ru: Вот, как все типы ячеек выглядят на экране.

# cellSwipeRightTitle
source: Actions on main screen
ru: Действия с ячейкой

# cellSwipeRightDescription
source: You can swipe any cell on your screen right and do several stuff...
ru: Свайпните вправо и выберите, что вы хотите сделать с этой ячейкой...

# firstSlideActionTitle
source: Edit action
ru: Действие "Редактировать"

# firstSlideActionDescription
source: Automatically redirects you to edit page of selected cell.
ru: Сразу перенаправляет вас на страницу редактирования этой ячейки.

# secondSlideActionTitle
source: Delete action
ru: Действие "Удалить"

# secondSlideActionDescription
source: BURN HIM TO THE GROUND.
ru: УНИЧТОЖЬ ЭТУ ЯЧЕЙКУ.

# groupCellRightSwipeTitle
source: Group cell actions
ru: Действия ячейки "Группа"

# groupCellRightSwipeDescription
source: But actions on group cell is actually different.
ru: Действия у групп немного другие.

# groupFirstActionTitle
source: Group editing
ru: Переименование группы

# groupFirstActionDescription
source: Group cell you only can rename on special menu
ru: Вы можете переименовать группу в специальном меню.

# simplePathNameTitle
source: Current table rename
ru: Название таблицы

# simplePathNameDescription
source: Double tap on table name to change title.
ru: Два раза нажмите на название таблицы, чтобы изменить её название.

# complexPathNameTitle
source: Current group rename
ru: Название группы

# complexPathNameDescription
source: Double tap on table name to change title of group you view.
ru: Два раза нажмите на название группы, чтобы изменить её название.

# drawerOpenButtonTitle
source: Open drawer
ru: Открыть правое меню

# drawerOpenButtonDescription
source: To open drawer, tap there.
ru: Чтобы открыть меню, нажмите сюда.

# tablesListTitle
source: Tables list
ru: Список таблиц

# tablesListDescription
source: View all your tables.
ru: У вас может быть много таблиц, и все они - здесь.

# addTableTitle
source: Table creation
ru: Создание таблицы

# addTableDescription
source: You also can tap there and create new table...
ru: По нажатию сюда вы перейдете на меню создания таблицы.

# settingsTitle
source: Settings
ru: Настройки

# settingsDescription
source: And there you can switch theme, color accent, language and so on...
ru: А тут вы сможете кастомизировать тему, цвет и язык под себя...
